---
kind: method
id: M:Autodesk.Revit.DB.Subelement.Dispose
source: html/4e7a26fc-f9ec-e77b-cfdf-0f2c009bfb50.htm
---
# Autodesk.Revit.DB.Subelement.Dispose Method

Releases all resources used by the Subelement

## Syntax (C#)
```csharp
public void Dispose()
```